docs/benchmark/results-wrk2-c1000/raw/nginx-R150000-r2.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.660ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.663ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.656ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.649ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71ms    1.29ms  19.98ms   90.50%
    Req/Sec    39.59k     3.47k   49.11k    66.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.45ms
 75.000%    2.07ms
 90.000%    2.79ms
 99.000%    7.86ms
 99.900%   13.52ms
 99.990%   16.58ms
 99.999%   19.01ms
100.000%   20.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            1         1.00
       0.694     0.100000        56473         1.11
       0.915     0.200000       112670         1.25
       1.103     0.300000       168730         1.43
       1.276     0.400000       225254         1.67
       1.451     0.500000       281313         2.00
       1.545     0.550000       309601         2.22
       1.649     0.600000       337530         2.50
       1.774     0.650000       365738         2.86
       1.911     0.700000       393865         3.33
       2.069     0.750000       421986         4.00
       2.155     0.775000       436152         4.44
       2.243     0.800000       449953         5.00
       2.347     0.825000       464055         5.71
       2.465     0.850000       478123         6.67
       2.609     0.875000       492277         8.00
       2.695     0.887500       499281         8.89
       2.791     0.900000       506313        10.00
       2.891     0.912500       513235        11.43
       3.003     0.925000       520287        13.33
       3.119     0.937500       527306        16.00
       3.183     0.943750       530821        17.78
       3.259     0.950000       534375        20.00
       3.357     0.956250       537824        22.86
       3.515     0.962500       541345        26.67
       3.777     0.968750       544853        32.00
       3.951     0.971875       546624        35.56
       4.135     0.975000       548379        40.00
       4.351     0.978125       550143        45.71
       4.755     0.981250       551895        53.33
       5.531     0.984375       553641        64.00
       6.095     0.985938       554524        71.11
       6.751     0.987500       555404        80.00
       7.455     0.989062       556281        91.43
       8.115     0.990625       557156       106.67
       8.887     0.992188       558039       128.00
       9.287     0.992969       558478       142.22
       9.823     0.993750       558916       160.00
      10.375     0.994531       559359       182.86
      10.847     0.995313       559800       213.33
      11.287     0.996094       560236       256.00
      11.551     0.996484       560452       284.44
      11.863     0.996875       560676       320.00
      12.159     0.997266       560893       365.71
      12.439     0.997656       561117       426.67
      12.719     0.998047       561330       512.00
      12.855     0.998242       561440       568.89
      12.975     0.998437       561552       640.00
      13.143     0.998633       561660       731.43
      13.303     0.998828       561769       853.33
      13.551     0.999023       561884      1024.00
      13.695     0.999121       561936      1137.78
      13.871     0.999219       561989      1280.00
      14.135     0.999316       562044      1462.86
      14.367     0.999414       562099      1706.67
      14.591     0.999512       562155      2048.00
      14.727     0.999561       562181      2275.56
      14.823     0.999609       562209      2560.00
      14.943     0.999658       562236      2925.71
      15.167     0.999707       562264      3413.33
      15.399     0.999756       562292      4096.00
      15.543     0.999780       562305      4551.11
      15.735     0.999805       562320      5120.00
      15.855     0.999829       562332      5851.43
      16.031     0.999854       562346      6826.67
      16.247     0.999878       562360      8192.00
      16.495     0.999890       562367      9102.22
      16.607     0.999902       562375     10240.00
      16.703     0.999915       562380     11702.86
      16.815     0.999927       562387     13653.33
      16.959     0.999939       562394     16384.00
      17.199     0.999945       562398     18204.44
      17.359     0.999951       562401     20480.00
      17.471     0.999957       562404     23405.71
      17.999     0.999963       562408     27306.67
      18.223     0.999969       562411     32768.00
      18.399     0.999973       562413     36408.89
      18.575     0.999976       562415     40960.00
      18.623     0.999979       562416     46811.43
      18.831     0.999982       562418     54613.33
      18.943     0.999985       562420     65536.00
      18.959     0.999986       562421     72817.78
      19.007     0.999988       562422     81920.00
      19.007     0.999989       562422     93622.86
      19.023     0.999991       562423    109226.67
      19.119     0.999992       562424    131072.00
      19.167     0.999993       562425    145635.56
      19.167     0.999994       562425    163840.00
      19.167     0.999995       562425    187245.71
      19.455     0.999995       562426    218453.33
      19.455     0.999996       562426    262144.00
      19.775     0.999997       562427    291271.11
      19.775     0.999997       562427    327680.00
      19.775     0.999997       562427    374491.43
      19.775     0.999998       562427    436906.67
      19.775     0.999998       562427    524288.00
      19.999     0.999998       562428    582542.22
      19.999     1.000000       562428          inf
#[Mean    =        1.706, StdDeviation   =        1.290]
#[Max     =       19.984, Total count    =       562428]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2156808 requests in 15.00s, 1.34GB read
Requests/sec: 143788.75
Transfer/sec:     91.46MB