docs/benchmark/results-wrk2-c1000/raw/nginx-R50000-r2.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 1.637ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.605ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.636ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.622ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.67ms    1.10ms  16.99ms   77.11%
    Req/Sec    13.17k     2.17k   26.00k    73.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.51ms
 75.000%    2.15ms
 90.000%    2.93ms
 99.000%    4.90ms
 99.900%   11.89ms
 99.990%   14.70ms
 99.999%   16.94ms
100.000%   17.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.059     0.000000            1         1.00
       0.547     0.100000        18762         1.11
       0.805     0.200000        37531         1.25
       1.043     0.300000        56296         1.43
       1.275     0.400000        75004         1.67
       1.512     0.500000        93776         2.00
       1.629     0.550000       103152         2.22
       1.744     0.600000       112570         2.50
       1.865     0.650000       121885         2.86
       1.997     0.700000       131248         3.33
       2.151     0.750000       140673         4.00
       2.241     0.775000       145368         4.44
       2.345     0.800000       150068         5.00
       2.461     0.825000       154703         5.71
       2.595     0.850000       159393         6.67
       2.749     0.875000       164072         8.00
       2.837     0.887500       166452         8.89
       2.931     0.900000       168785        10.00
       3.035     0.912500       171121        11.43
       3.149     0.925000       173458        13.33
       3.277     0.937500       175801        16.00
       3.351     0.943750       176967        17.78
       3.433     0.950000       178119        20.00
       3.529     0.956250       179312        22.86
       3.643     0.962500       180474        26.67
       3.775     0.968750       181655        32.00
       3.849     0.971875       182232        35.56
       3.939     0.975000       182810        40.00
       4.043     0.978125       183395        45.71
       4.175     0.981250       183985        53.33
       4.347     0.984375       184563        64.00
       4.459     0.985938       184861        71.11
       4.595     0.987500       185156        80.00
       4.759     0.989062       185442        91.43
       5.003     0.990625       185738       106.67
       5.403     0.992188       186028       128.00
       5.831     0.992969       186174       142.22
       6.235     0.993750       186322       160.00
       6.603     0.994531       186467       182.86
       6.999     0.995313       186614       213.33
       7.643     0.996094       186760       256.00
       7.939     0.996484       186836       284.44
       8.247     0.996875       186908       320.00
       8.567     0.997266       186981       365.71
       9.183     0.997656       187053       426.67
       9.767     0.998047       187126       512.00
      10.159     0.998242       187163       568.89
      10.495     0.998437       187200       640.00
      11.215     0.998633       187237       731.43
      11.551     0.998828       187274       853.33
      11.943     0.999023       187309      1024.00
      12.183     0.999121       187328      1137.78
      12.327     0.999219       187346      1280.00
      12.543     0.999316       187364      1462.86
      12.703     0.999414       187383      1706.67
      12.839     0.999512       187401      2048.00
      12.999     0.999561       187410      2275.56
      13.143     0.999609       187420      2560.00
      13.231     0.999658       187428      2925.71
      13.295     0.999707       187438      3413.33
      13.415     0.999756       187448      4096.00
      13.511     0.999780       187451      4551.11
      13.895     0.999805       187456      5120.00
      14.079     0.999829       187460      5851.43
      14.263     0.999854       187465      6826.67
      14.463     0.999878       187470      8192.00
      14.679     0.999890       187472      9102.22
      14.735     0.999902       187474     10240.00
      14.815     0.999915       187476     11702.86
      15.207     0.999927       187479     13653.33
      15.623     0.999939       187481     16384.00
      15.743     0.999945       187482     18204.44
      15.855     0.999951       187483     20480.00
      15.991     0.999957       187484     23405.71
      16.559     0.999963       187486     27306.67
      16.591     0.999969       187487     32768.00
      16.591     0.999973       187487     36408.89
      16.735     0.999976       187488     40960.00
      16.735     0.999979       187488     46811.43
      16.943     0.999982       187490     54613.33
      16.943     0.999985       187490     65536.00
      16.943     0.999986       187490     72817.78
      16.943     0.999988       187490     81920.00
      16.943     0.999989       187490     93622.86
      16.959     0.999991       187491    109226.67
      16.959     0.999992       187491    131072.00
      16.959     0.999993       187491    145635.56
      16.959     0.999994       187491    163840.00
      16.959     0.999995       187491    187245.71
      17.007     0.999995       187492    218453.33
      17.007     1.000000       187492          inf
#[Mean    =        1.670, StdDeviation   =        1.102]
#[Max     =       16.992, Total count    =       187492]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  719257 requests in 15.00s, 457.52MB read
Requests/sec:  47949.66
Transfer/sec:     30.50MB